{"data":{"allStrapiArticle":{"edges":[{"node":{"strapiId":4,"Content":"While you may feel like stuck in home quarantine, it's probably time to try out new things, I mean some new beers :wink: :beers:.\n\n##My TOP 5 craft beers \n\n###1. AgrárX :hungary: \nNo text needed, Hungary's best double ipa ever. If you can try out the tapped version, you won't try out any other beers... :reminder_ribbon:\n![Screenshot 2020-05-05 at 0.08.39](http://localhost:1337/uploads/Screenshot_2020-05-05_at_0.08.39_fbb73fb369.png)\n\n###2. Liquid Cocaine  :hungary:\nA mug of this beer contains 10 grams of hops, and the alcohol content of two shots of tequila. Need more pro? :wink:\n![Screenshot 2020-05-05 at 0.10.38](http://localhost:1337/uploads/Screenshot_2020-05-05_at_0.10.38_c6be4627b1.png)\n\n\n###3.  Mango Bay  :hungary:\nI really like tropical and sour IPAs too, but this mango flavored ale is a starter for me.\n\n![Screenshot 2020-05-05 at 0.11.03](http://localhost:1337/uploads/Screenshot_2020-05-05_at_0.11.03_1b482f617d.png)\n\n###4. Hazy Queen :hungary:\nA New England IPA. Smooth, juicy and double dry-hopped with generous amounts of Galaxy, Citra and Mosaic hops. Drink Fresh!\n\n![Screenshot 2020-05-05 at 0.10.04](http://localhost:1337/uploads/Screenshot_2020-05-05_at_0.10.04_a14e40b0df.png)\n\n###5. Clwb Tropica :uk:\nThis grown up fruit salad is as colourful as the most hideous Hawaiian shirt you’ve ever seen. It’s super juicy and crammed full of fruity hop flavours that will have your mouth watering.\n\n![Screenshot 2020-05-05 at 0.16.48](http://localhost:1337/uploads/Screenshot_2020-05-05_at_0.16.48_4f1ca63f1f.png)\n\n###EXTRA 1  - My favorite craft beer pub: [Bölcső](https://www.facebook.com/bolcsobar/)\n\n![Screenshot 2020-05-05 at 0.18.00](http://localhost:1337/uploads/Screenshot_2020-05-05_at_0.18.00_ed4877ca9b.png)\n\n\n###EXTRA 2 - My Daily UI checkout form with some beer ([Dribbble](https://dribbble.com/shots/11286322-Checkout-some-fresh-beer)):\n\n![002](http://localhost:1337/uploads/002_29de72537b.png)\n\n","Title":"My top 5 craft beer","published_at":"2020-05-04","image":{"publicURL":"/static/852e2edc3c45df6392e9088046c7ea09/f3115ee4eaccc1d3c44b26534325cefa.svg"}}},{"node":{"strapiId":3,"Content":"> Become a better designer in 100 Days\n\nThat's the main slogan of Daily UI. But I'm a Software Engineer, why did I start it?\n \nFor me, [Daily UI](https://dailyui.co) is a really contentful, and fun series of challenges, to improve your creativity, content creation, and product planning skills. I don't like coding on its own, I get excited when there's some interesting challe[text](link)nge next to it when I can use my creativity. I had several projects and jobs where I could design sites, UI, or branding elements.\n\nFor inspiration, I always check out  [Dribbble](https://dribbble.com). Back in 2006, I started Daily UI for the fist time, but I \"failed\" it. :grimacing: I only completed 3 days, and I got distracted, here are my 3 shots from back then:\n\n![Screenshot 2020-05-03 at 11.56.47](http://localhost:1337/uploads/Screenshot_2020-05-03_at_11.56.47_9e6beb384e.png)\n\nYou can also check out **my Dribbble profile** here: [@balaki_me](https://dribbble.com/balaki_me).\n\nAnd drumroll :drum:, I started it again, but now I try to keep up, my first shot is [here](https://dribbble.com/shots/11257488-Plantbro-Sign-up):\n![Screenshot 2020-05-03 at 12.07.19](http://localhost:1337/uploads/Screenshot_2020-05-03_at_12.07.19_774ec7f26c.png)\n","Title":"I started Daily UI (again)","published_at":"2020-05-03","image":{"publicURL":"/static/c7b4e002e739a5919ef3d62b561a7b9a/6b5779a6860b0fd07d331e38c356df17.svg"}}},{"node":{"strapiId":2,"Content":"## Hero to zero\nYesterday I had 42 article ideas, how I'll start my blog, and I'll write about tech, personal topics. Today morning I had 0 ideas. I dismissed them all.  So today's blog article is about how I struggle to take on new things.  :flushed:\n\n![](https://media.giphy.com/media/3owypkSIpM8xw6p7W0/giphy.gif)\n\nI didn't know how to start, then I realized I *over-engineered* decision making again. I was afraid that I choose the wrong way to start, follow a bad path, and write about useless things. **That's just stupid.**\n\nThe solution is: :tada: \n\n![](https://media.giphy.com/media/UqZ4imFIoljlr5O2sM/giphy.gif)\n\n## Just Do it\nIt sounds like a nonsense quote or a badly timed Nike advertisement, but.\nBut it always helped me, **I always force myself to take on new challenges**, e.g. buying courses, signing up for competitions, accepting new projects, by these things I encourage myself by having hard deadlines.\n\nSome of them fail, but the things that work out have a really good impact on my personal and professional life.\n\n### 1. Buying courses\nIf you invest money in your learning you may be a bit more focused, and encouraged to follow on your learning path. \n\nI always try to find tutorial projects, and examples on the web, but an up to date course with a lot of learning assets is better for improving yourself in an area that you don't really know.\n\nFor some web, tech, design-related courses check out: [Udemy](https://udemy.com), [Egghead](egghead.io), and [LearnUX](https://learnux.io/).\n\n### 2. Competitions\nCompetition is a good thing. You try to best the others, improve your skills, and try doing things faster.\n\nMy absolute biggest competitions were the World and the European championships. I could not even believe that I can create fully functioning projects, websites, every day in 6 hours. But that's possible, I had to practice for months, day to day with a timer to do basic tasks faster and faster, but I followed that path and succeded. I liked it so I just did it every day. :wink:\n### 3. New projects\nHaving deadlines, and having e.g. colleagues, bosses telling you to do this and that may be a bad influence for someone, but for me having a person who has another idea about something is a good influence. It helps me to think about things the other way.\n\nWith new projects, you can take on new deadlines, and milestones that will help you to improve and get better.\n \n\n## Don't do it\nIt's not a bad thing if you fail. I failed a lot of personal and professional projects. For some other people who were not involved it may seem like that I was lazy, or I was not caring, but it's false.\nFailing is good, I always fail if I don't feel like doing something for a long time, and count that as I got wiser what to do next.\n\n\n\nThanks for reading this kind of sentimental, random post.\nIt really helped me to start. :smile:","Title":"How to start blogging","published_at":"2020-05-02","image":{"publicURL":"/static/75672ddecd64cea861ce961a79e63178/ece3fc9debe4b2393bb56f8644f4d675.svg"}}},{"node":{"strapiId":1,"Content":"> :mega: I joined Kinsta's internal **100 Days of Blogging Challenge** (May 1st to Aug 9th, 2020)\n\nWhen I joined [Kinsta](https://kinsta.com) as a Developer, I knew I'd learn a lot, and try out new things... But I never thought that my company will help me to finally start (actually continue) blogging. :smiley:\n\nBlogging for 100 days, coming up with new topics will be hard, I plan to write a lot about **tech and design related topics**. The next few post will be about how I created this blog, what tech I use, and some interesting personal info.\nI will also join the [Daily UI](https://www.dailyui.co/) challenge and create digest posts weekly with my designs.\n\nAnd for now some fun facts about the [balaki.me](https://balaki.me):\n- The blog is hosted on Github Pages\n- I use [Strapi](https://strapi.io/) for content management, with GraphQL api\n- The blog is generated with [Gatsby](https://gatsbyjs.org), using React, and a self-written template\n- This is a free domain from [NameCheap](https://www.namecheap.com/), (my cert and some things are just being issued right now).\n\nStay tuned. \n*balaki*","Title":"The 100 days blogging challenge","published_at":"2020-05-01","image":{"publicURL":"/static/cb0211446c0dccbddf2f50ec043fca9b/26c559d936e7dd02dbf5ee14aca2f9fa.svg"}}}]}}}